{
	"0": {
		"text": [
			"Your name is Ashlyn, and this morning you rise with the sun.",
			"As you rub the sleep out of your eyes, you remember that your sister Iris is turning ten today."
		],
		"options": {
			"Consider your goals.": [
				"1"
			]
		},
		"location": "Home"
	},
	"1": {
		"text": [
			"You want to bake a cake for Iris' birthday dinner, but not just any cake – it should feature some kind of unique ingredient. A Tenti pineapple from the Bedabin nomads would probably do. You also need to level up your skills today by training Woodcutting, Agility, and Mining, or at least two of the three. And at some point, you'd like to stop by Nardah to talk to your friend Ali the Wise, whom you haven't seen in a while. You aim to accomplish all of these goals without leaving the desert.",
			"Complicating all of this is the fact that it's a bank holiday, meaning that the Bank of Gielinor and many shops will be closed. You'll have to make do with the items and money you bring from home, as well as whatever you happen to find on your travels.",
			"Your cats, Pax and Nike, paw at each other playfully as you don your robes and briefly contemplate what ring to wear.",
			"[Note: the activated ring of Charos is the most forgiving option for a first playthrough.]"
		],
		"options": {
			"An activated ring of Charos.": [
				"2"
			],
			"A ring of life.": [
				"3"
			],
			"A ring of sand.": [
				"4"
			]
		}
	},
	"2": {
		"text": [
			"This ring will halve the cost of magic carpet rides, and might help you persuade some particularly gullible individuals.",
			"You have 12 hours to finish your goals for the day."
		],
		"options": {
			"Leave the house, bringing Pax and Nike with you.": [
				"20"
			]
		},
		"gain": ["Ring of Charos"]
	},
	"3": {
		"text": [
			"This ring will allow you to be more bold in combat encounters, fighting instead of fleeing in situations where the odds might be against you.",
			"You have 12 hours to finish your goals for the day."
		],
		"options": {
			"Leave the house, bringing Pax and Nike with you.": [
				"20"
			]
		},
		"gain": ["Ring of Charos"]
	},
	"4": {
		"text": [
			"This ring will allow you to turn into a pile of sand. You're... not sure what practical uses it has. Who can say?",
			"You have 12 hours to finish your goals for the day."
		],
		"options": {
			"Leave the house, bringing Pax and Nike with you.": [
				"20"
			]
		},
		"gain": ["Ring of Charos"]
	}
}