{
	"0": {
		"text": [
			"Your name is Ashlyn, and this morning you rise with the sun.",
			"As you rub the sleep out of your eyes, you remember that your sister Iris is turning ten today.",
			"[Enter a number to continue.]"
		],
		"options": {
			"Consider your goals.": [
				"1"
			]
		},
		"location": "Home"
	},
	"1": {
		"text": [
			"You want to bake a cake for Iris' birthday dinner, but not just any cake -- it should feature some kind of unique ingredient. A Tenti pineapple from the Bedabin nomads would probably do. You also need to level up your skills today by training Woodcutting, Agility, and Mining, or at least two of the three. And at some point, you'd like to stop by Nardah to talk to your friend Ali the Wise, whom you haven't seen in a while. You aim to accomplish all of these goals without leaving the desert.",
			"Complicating all of this is the fact that it's a bank holiday, meaning that the Bank of Gielinor and many shops will be closed. You'll have to make do with the items and money you bring from home, as well as whatever you happen to find on your travels.",
			"Your cats, Pax and Nike, paw at each other playfully as you don your robes and briefly contemplate what ring to wear.",
			"[Note: The activated ring of Charos is the most forgiving option for a first playthrough.]"
		],
		"options": {
			"An activated ring of Charos.": [
				"2"
			],
			"A ring of life.": [
				"3"
			],
			"A ring of sand.": [
				"4"
			]
		}
	},
	"2": {
		"text": [
			"This ring will halve the cost of magic carpet rides, and might help you persuade some particularly gullible individuals.",
			"You have 14 hours to finish your goals for the day."
		],
		"options": {
			"Leave the house, bringing Pax and Nike with you.": [
				"20"
			]
		},
		"gain": [
			"Ring of Charos"
		]
	},
	"3": {
		"text": [
			"This ring will allow you to be more bold in combat encounters, fighting instead of fleeing in situations where the odds might be against you.",
			"You have 14 hours to finish your goals for the day."
		],
		"options": {
			"Leave the house, bringing Pax and Nike with you.": [
				"20"
			]
		},
		"gain": [
			"Ring of life"
		]
	},
	"4": {
		"text": [
			"This ring will allow you to turn into a pile of sand. You're... not sure what practical uses it has. Who can say?",
			"You have 14 hours to finish your goals for the day."
		],
		"options": {
			"Leave the house, bringing Pax and Nike with you.": [
				"20"
			]
		},
		"gain": [
			"Ring of sand"
		]
	},
	"5": {
		"text": [
			"The rug merchant greets you and your cats with a smile. \"Are we looking to travel today?\""
		],
		"options": {
			"Ask about a destination.": [
				"6"
			],
			"[1000 coins] Ride the magic carpet.": [
				"17"
			],
			"[Ring of Charos] \"Would it be possible to get a discount?\"": [
				"8"
			],
			"\"Actually, never mind.\"": [
				"-1"
			]
		}
	},
	"6": {
		"text": [
			"\"Sure, where would you like to know about?\""
		],
		"options": {
			"Ask about Al Kharid.": [
				"9"
			],
			"Ask about the Bedabin camp.": [
				"10"
			],
			"Ask about Menaphos.": [
				"11"
			],
			"Ask about the monkey colony.": [
				"12"
			],
			"Ask about Nardah.": [
				"13"
			],
			"Ask about Pollnivneach.": [
				"14"
			],
			"Ask about Sophanem.": [
				"15"
			],
			"Ask about Uzer.": [
				"16"
			]
		}
	},
	"7": {
		"text": [
			"\"Where would you like to go?\""
		],
		"options": {
			"Travel to Al Kharid.": [
				"180"
			],
			"Travel to the Bedabin camp.": [
				"181"
			],
			"Travel to Menaphos.": [
				"182"
			],
			"Travel to the monkey colony.": [
				"183"
			],
			"Travel to Nardah.": [
				"184"
			],
			"Travel to Pollnivneach.": [
				"185"
			],
			"Travel to Sophanem.": [
				"186"
			],
			"Travel to Uzer.": [
				"187"
			]
		}
	},
	"8": {
		"text": [
			"\"I don't normally do this, but for such a nice young woman like yourself, with two adorable kitties in tow...\" The merchant hums in consideration as your cats assume their most innocent, nonthreatening poses. \"Sure, I'll lower the cost to 500 coins.\""
		],
		"options": {
			"[500 coins] Ride the magic carpet.": [
				"18"
			],
			"\"Actually, never mind.\"": [
				"-1"
			]
		}
	},
	"9": {
		"text": [
			"\"The Emirate of Al Kharid is, as you know, one of the principal city-states of the desert. However,\" the merchant's voice drops to a conspiratorial whisper, \"I've heard rumours of roving gangs of bandits who lurk just beyond the Shantay Pass, hoping to intercept rich Menaphite tourists and steal their belongings. You'll have to keep your wits about you.\""
		],
		"options": {
			"Continue.": [
				"5"
			]
		},
		"time": 0.25
	},
	"10": {
		"text": [
			"\"A bunch of uncultured primitives if you ask me,\" the merchant sniffs with disdain. \"Although I've heard they grow good pineapples.\""
		],
		"options": {
			"Continue": [
				"5"
			]
		},
		"time": 0.25
	},
	"11": {
		"text": [
			"\"Ah, Menaphos! The veritable jewel of the desert! The shining pearl of the Southern Sea! The home of anything and everything your heart could ever desire!\" The merchant pauses, gasping for breath. \"Also good Woodcutting opportunities.\""
		],
		"options": {
			"Continue": [
				"5"
			]
		},
		"time": 0.25
	},
	"12": {
		"text": [
			"\"To be honest, I've never been there. I know it's a stop that was only set up recently, and I know it's got monkeys and I don't trust those.\""
		],
		"options": {
			"Continue": [
				"5"
			]
		},
		"time": 0.25
	},
	"13": {
		"text": [
			"\"The home of the humble choc-ice. Nardah's a bit of a backwater in my opinion, but it's got its charms. I heard some adventurer did some woo-woo nonsense with river spirits a few years ago and now their well works again.\""
		],
		"options": {
			"Continue": [
				"5"
			]
		},
		"time": 0.25
	},
	"14": {
		"text": [
			"\"Pollnivneach is... well, it's no longer plagued by rival bands of thugs, which is good for business. The Asp and Snake produces the finest mug of grog you've ever tasted.\" The merchant peers at you. \"Although I'm not sure if you're old enough to drink.\"",
			"\"I am,\" you tell her, \"but I'm too busy today.\" And every other day, come to think of it."
		],
		"options": {
			"Continue": [
				"5"
			]
		},
		"time": 0.25
	},
	"15": {
		"text": [
			"\"I wouldn't go to Sophanem if I were you. There's nothing to do there except catch the plague and train Agility.\" You don't bother explaining to her that the plague isn't contagious to outsiders."
		],
		"options": {
			"Continue": [
				"5"
			]
		},
		"time": 0.25
	},
	"16": {
		"text": [
			"\"Ruins,\" the merchant intones solemnly. \"Ruins, and a few necrite rocks for Mining. And I've never been one for history or manual labour, so it's of no use to me.\""
		],
		"options": {
			"Continue": [
				"5"
			]
		},
		"time": 0.25
	},
	"17": {
		"text": [
			"The merchant counts the money you hand her, and nods."
		],
		"options": {
			"Continue": [
				"7"
			]
		},
		"loss": [
			"1000 coins"
		]
	},
	"18": {
		"text": [
			"The merchant counts the money you hand her, and nods."
		],
		"options": {
			"Continue": [
				"7"
			]
		},
		"loss": [
			"500 coins"
		]
	},
	"20": {
		"text": [
			"You are in Pollnivneach."
		],
		"options": {
			"Consider your surroundings.": [
				"21"
			],
			"Travel to another settlement.": [
				"5"
			],
			"[Al Shabim's contract] Visit Rana, the dyer.": [
				"22"
			]
		},
		"location": "Pollnivneach"
	},
	"21": {
		"text": [
			"Pollnivneach has been calmer since the gangs left; almost deceptively calm. It's easy to be lulled by the smoky sizzle of kebab meat from Isma'il's stand and the hypnotic notes of the snake charmer's oboe, easy to forget about the horrors that lurk in the well and the incarnation of the Devourer who lives right next door. You figure that if nothing else, living here permits you to keep an eye on Sumona. Plus, it's remote enough that your parents don't come around to bother you much."
		],
		"options": {
			"Continue.": [
				"20"
			]
		}
	},
	"22": {
		"text": [
			"Rana the dyer lives on the northern side of town, on the shore of the river. She looks up from her work as you lift the curtain to her shop."
		],
		"options": {
			"Ask about blue dye.": [
				"23"
			],
			"[Woad leaves] \"I've got your woad leaves here with me.\"": [
				"25"
			],
			"[Bottle of black dye] \"I've got your bottle of black dye here with me.\"": [
				"26"
			],
			"Return to the streets of Pollnivneach.": [
				"20"
			]
		},
		"location": "Rana the dyer's shop",
		"time": 0.25
	},
	"23": {
		"text": [
			"\"Hi, Rana! I'm looking for some blue dye today.\"",
			"\"It'll cost you 25 coins,\" she tells you."
		],
		"options": {
			"[25 coins] \"Okay...\"": [
				"24"
			],
			"\"That's actually a bit expensive, never mind.\"": [
				"22"
			]
		}
	},
	"24": {
		"text": [
			"\"...and two woad leaves,\" she concludes, pocketing the coins you give her."
		],
		"options": {
			"\"The banks are closed today. Where am I supposed to get woad leaves in the desert?\"": [
				"27"
			]
		},
		"loss": [
			"25 coins"
		]
	},
	"25": {
		"text": [
			"\"Excellent,\" says Rana. \"Here's my end of the deal.\" She takes the leaves and goes to the back of the shop. When she returns, she is holding a bottle of blue dye, which she proffers to you."
		],
		"options": {
			"Continue.": [
				"22"
			]
		},
		"gain": [
			"Bottle of blue dye"
		],
		"loss": [
			"Rana's contract",
			"Woad leaves"
		]
	},
	"26": {
		"text": [
			"\"Excellent,\" says Rana. \"Here's my end of the deal.\" She takes the black dye and goes to the back of the shop. When she returns, she is holding a bottle of blue dye, which she proffers to you."
		],
		"options": {
			"Continue": [
				"22"
			]
		},
		"gain": [
			"Bottle of blue dye"
		],
		"loss": [
			"Rana's contract",
			"Bottle of black dye"
		]
	},
	"27": {
		"text": [
			"\"I would see if the merchants in Al Kharid or Menaphos sell any,\" advises Rana. \"If you can't find woad leaves, I'd also be happy to trade a bottle of blue dye for a bottle of black dye. You can make it with black mushrooms, which grow in dark, abandoned places... or so I've heard.\"",
			"She signs a contract promising to give you blue dye for either two woad leaves or a bottle of black dye, then passes the contract to you. Pax almost bats it out of your hand."
		],
		"options": {
			"Time to find either of those things, then.": [
				"22"
			]
		},
		"gain": [
			"Rana's contract"
		]
	},
	"40": {
		"text": [
			"You are in the Bedabin camp."
		],
		"options": {
			"Consider your surroundings.": [
				"41"
			],
			"Visit Al Shabim, the leader of the camp.": [
				"42"
			],
			"Visit Asgarnia Smith.": [
				"46"
			],
			"Travel to another settlement.": [
				"5"
			]
		},
		"location": "Bedabin camp"
	},
	"41": {
		"text": [
			"The Bedabin camp has grown since you last visited, though you can't help but suspect that one particularly harsh sandstorm is all it would take to level the settlement. Camels sip water from a freshwater oasis, sending shimmering ripples across its placid surface. Far across the bay, you can just make out the jagged shape of the Kalphite Hive."
		],
		"options": {
			"Continue.": [
				"40"
			]
		}
	},
	"42": {
		"text": [
			"\"Ah, effendi.\" Al Shabim raises his hand in greeting. \"It is good to see you again.\""
		],
		"options": {
			"Ask about buying a Tenti pineapple.": [
				"43"
			],
			"[Bottle of blue dye] \"I've got your dye here with me.\"": [
				"45"
			],
			"Return to the Bedabin camp.": [
				"40"
			]
		},
		"location": "Al Shabim's tent",
		"time": 0.25
	},
	"43": {
		"text": [
			"\"I do not have much use for coin,\" he tells you. \"Our people run something of a barter economy.\"",
			"\"Is there something I can get you, then?\"",
			"He thinks. \"A bottle of blue dye would be useful for our weavers. Seek out Rana the dyer in Pollnivneach. And please, take this signed contract as proof that I shall uphold my end of the exchange.\""
		],
		"options": {
			"Fine, this should be simple enough.": [
				"42"
			],
			"[Ring of Charos] \"Even after I helped you steal the schematics for making darts?\"": [
				"44"
			]
		},
		"gain": [
			"Al Shabim's contract"
		]
	},
	"44": {
		"text": [
			"Al Shabim ponders this for a long moment. \"If you bring me the dye,\" he finally says, \"I could get you... two pineapples?\""
		],
		"options": {
			"You sigh. \"Never mind.\"": [
				"42"
			]
		}
	},
	"45": {
		"text": [
			"\"This is just what we needed! Many thanks, effendi. Here is your Tenti pineapple, as promised.\""
		],
		"options": {
			"Thank goodness that's finally done with.": [
				"42"
			]
		},
		"goals": "Obtain cake ingredient",
		"gain": [
			"Tenti pineapple"
		],
		"loss": [
			"Al Shabim's contract",
			"Bottle of blue dye"
		]
	},
	"46": {
		"text": [
			"Asgarnia Smith is leaning against a palm tree, fanning himself with his broad-brimmed hat. He nods as you approach. \"Oi, adventurer! You're back.\""
		],
		"options": {
			"\"And you're... still here?\" you ask.": [
				"47"
			]
		},
		"time": 0.25
	},
	"47": {
		"text": [
			"\"Yeah, this camp is my base when I'm between expeditions. That is, until I dig up my first big-time find! Then I'll hire interns to do all the hard work for me.\" A boyish grin spreads across his sunburnt face, making him look younger than his years. \"Any day now!\"",
			"You hold no particular affection for Asgarnia Smith. If you came to talk to him, it was because you had a certain hypothesis that needed disproving, for your own peace of mind."
		],
		"options": {
			"Problem is, you don't know how you could possibly begin to tell.": [
				"48"
			]
		}
	},
	"48": {
		"text": [
			"\"Asgarnia, do you... I mean, are you...?\"",
			"Not like he would let on if he was. But... surely not. Look at him. There is not one single thought behind those big, brown eyes. Something tells you that everything here is exactly as it seems."
		],
		"options": {
			"You let out a breath you didn't know you'd been holding. \"See you around, Asgarnia!\" Or, ideally, not.": [
				"40"
			]
		}
	},
	"60": {
		"text": [
			"You are in Menaphos."
		],
		"options": {
			"Consider your surroundings.": [
				"61"
			],
			"Visit the imperial district to train Woodcutting.": [
				"62"
			],
			"[Rana's contract] Ask around to see if any of the merchants sell woad leaves.": [
				"63"
			],
			"Travel to another settlement.": [
				"5"
			]
		},
		"location": "Menaphos merchant district"
	},
	"61": {
		"text": [
			"There is a certain hypocrisy inherent to Menaphos that is most pronounced in its merchant district, where would-be moguls hawk outrageously-priced wares mere streets away from the slave quarter. You can't deny that the city is a skiller's paradise, but you don't like to hang around here when not training or questing."
		],
		"options": {
			"Continue.": [
				"60"
			]
		}
	},
	"62": {
		"text": [
			"A group of guards tries to stop you from disrupting the peace of the imperial district during the holiday, but once you begin enumerating your long list of services rendered to the city, they realize you might well be too important to offend. Once they leave, you spend an hour cutting down acadia trees."
		],
		"options": {
			"Good thing the deposit box is still open on holidays.": [
				"60"
			]
		},
		"location": "Menaphos imperial district",
		"goals": "Woodcutting",
		"time": 1
	},
	"63": {
		"text": [
			"There is, apparently, only one merchant in Menaphos in possession of woad leaves, and he tends his stall in a narrow alleyway on the edge of the district. However, as he explains, \"the woad isn't for sale. I'm gonna sell this shop by the end of the month and be the first man to set up a farm in the Kharidian Desert!\""
		],
		"options": {
			"You smile to hide your bewilderment. \"I don't think a farm would do very well out here.\"": [
				"64"
			]
		},
		"time": 0.25
	},
	"64": {
		"text": [
			"\"You'll believe it when you see it!\" he huffs. \"And you'll see it when it's built. Anyway, I might be willing to give you some woad leaves for free if you answer my riddle.\" Before you can protest, he begins. \"If a creature walks on four limbs in the morning, two in the afternoon, and three in the evening, how many limbs did it have in total?\"",
			"\"I'm... pretty sure that's not how that riddle goes...\"",
			"\"Answer it!\""
		],
		"options": {
			"One.": [
				"65"
			],
			"Two.": [
				"65"
			],
			"Three.": [
				"65"
			],
			"Four.": [
				"66"
			],
			"Five.": [
				"65"
			],
			"Six.": [
				"65"
			],
			"Seven.": [
				"65"
			],
			"Eight.": [
				"65"
			],
			"Nine.": [
				"65"
			],
			"Ten.": [
				"65"
			],
			"[Ring of Charos] \"Come on, we both know this is silly.\"": [
				"67"
			]
		}
	},
	"65": {
		"text": [
			"\"Incorrect! No woad for you!\"",
			"Ugh."
		],
		"options": {
			"Just steal the leaves when he's not looking.": [
				"68"
			],
			"Return to the streets of Menaphos.": [
				"60"
			]
		}
	},
	"66": {
		"text": [
			"\"Correct!\" He gives you a handful of leaves, seeming very satisfied with himself."
		],
		"options": {
			"Return to the streets of Menaphos.": [
				"60"
			]
		},
		"gain": [
			"Woad leaves"
		]
	},
	"67": {
		"text": [
			"\"That riddle doesn't even make sense. Besides, you can spare two leaves from your giant stash.\"",
			"\"You're no fun,\" he complains, but hands you the leaves anyway."
		],
		"options": {
			"Return to the streets of Menaphos.": [
				"60"
			]
		},
		"gain": [
			"Woad leaves"
		]
	},
	"68": {
		"text": [
			"It's easier than you expect it to be. He really isn't the observant type."
		],
		"options": {
			"Return to the streets of Menaphos.": [
				"60"
			]
		},
		"gain": [
			"Woad leaves"
		]
	},
	"80": {
		"text": [
			"You are in Uzer."
		],
		"options": {
			"Consider your surroundings.": [
				"81"
			],
			"Descend to the temple basement.": [
				"82"
			],
			"Visit the mine.": [
				"83"
			],
			"Travel to another settlement.": [
				"5"
			]
		},
		"location": "Uzer"
	},
	"81": {
		"text": [
			"Uzer is almost completely abandoned these days now that Agrith Naar's followers have dispersed. Only the most desperate treasure hunters dare to venture out here, and few make it back alive. You squint at the sandswept ruins, the temple foundations, the ancient mastaba, and try to imagine this place as the resplendent hub of civilization it was before the God Wars. It's hard. "
		],
		"options": {
			"Continue.": [
				"80"
			]
		}
	},
	"82": {
		"text": [
			"The temple basement is uncomfortably musty. You press the sleeve of your robes against your face, trying not to inhale any mold spores. Inspecting the chambers one by one, you come across a cluster of black mushrooms growing in a corner, and press them into dye."
		],
		"options": {
			"Return upstairs.": [
				"80"
			]
		},
		"location": "Temple basement",
		"time": 0.25,
		"gain": [
			"Bottle of black dye"
		]
	},
	"83": {
		"text": [
			"Mining necrite under the scorching desert sun is hard work. You spend an hour shovelling heaps of the unrefined material into your ore box, and your arms ache by the end of it."
		],
		"options": {
			"Return to the ruins of Uzer.": [
				"80"
			]
		},
		"location": "Necrite mine",
		"goals": "Mining",
		"time": 1
	},
	"100": {
		"text": [
			"You are outside Sophanem."
		],
		"options": {
			"Consider your surroundings.": [
				"101"
			],
			"Visit the Agility pyramid.": [
				"102"
			],
			"Travel to another settlement.": [
				"5"
			]
		},
		"location": "Outside Sophanem"
	},
	"101": {
		"text": [
			"The imposing walls of Sophanem stand before you. You don't have a reason to enter the city proper, but your cats tug at you anyway, trying to guide you towards the massive golden doors. They like hanging out with the Sphinx."
		],
		"options": {
			"Continue.": [
				"100"
			]
		}
	},
	"102": {
		"text": [
			"You make the journey out to the Agility pyramid, and spend an hour jumping, sliding, and clambering across the giant obstacle course. Pax and Nike lead the way, leaping elegantly over the unstable stone blocks and giving you disdainful looks when you cannot do the same."
		],
		"options": {
			"Return to the gates of Sophanem.": [
				"100"
			]
		},
		"location": "Agility pyramid",
		"goals": "Agility",
		"time": 1
	},
	"120": {
		"text": [
			"You approach Al Kharid... but as you do so, you realize with some concern that the magic carpet station has been occupied by a band of a dozen armed thugs. The rug merchant is nowhere to be found.",
			"The thugs sneer at you as you land. Their rune scimitars glint in the sunlight."
		],
		"options": {
			"[Ring of life] You can take them.": [
				"121"
			],
			"It's not worth the risk, and you have other places to be. You decide to try to leave.": [
				"123"
			]
		},
		"location": "Outside Al Kharid"
	},
	"121": {
		"text": [
			"You don't actually expect the ring's ability to come into play, given that this isn't your first time facing armed brigands, but having a failsafe gives you more room to make bold decisions.",
			"The first shadow spell you cast forcefully launches one brigand into the one behind him, incapacitating them both. You follow it up with several ice bursts, binding the next four enemies in place and allowing you to clear some distance. Another few shadow spells are enough to dispatch three of the four, but the last one dodges your blast, breaks free of the bind, and manages to graze your arm with his scimitar. You briefly wince at the pain before finishing him off with a blood blitz that restores the vitality you'd lost. Pax jumps onto his unmoving body and claws at him some more for good measure."
		],
		"options": {
			"That's half of them dealt with.": [
				"122"
			]
		},
		"time": 0.25
	},
	"122": {
		"text": [
			"Realizing how severely they'd underestimated you, the rest of the thugs run off towards the Shantay Pass. You don't bother following them. Instead, your attention is drawn to an item hanging out of the pocket of one of the unconscious thugs. You reach in and pull out...",
			"Surely it can't be...?",
			"An amulet of horsespeak.",
			"...Well, that's just weird."
		],
		"options": {
			"Anyways, you're done here. Time to figure out how to get this carpet working without an operator.": [
				"123"
			]
		},
		"gain": [
			"Amulet of horsespeak"
		],
		"achievement": [
			"The Most Useless Item in Gielinor",
			"Obtained an amulet of horsespeak."
		]
	},
	"123": {
		"text": [
			"The next instant, you and your cats are back on the magic carpet. You aren't sure how to specify a destination or get it moving in the first place, but to your surprise, it lifts off automatically, heading south and then east. Seems like these things have a mind of their own when their masters aren't around."
		],
		"options": {
			"Continue.": [
				"185"
			]
		}
	},
	"140": {
		"text": [
			"You are in the monkey colony."
		],
		"options": {
			"Just as you step off the carpet, you feel a strange, cold ripple in the air.": [
				"141"
			]
		},
		"location": "Monkey colony"
	},
	"141": {
		"text": [
			"Something is happening in the Shadow Realm at this location. You should find out what it is.",
			"Concentrating hard, you embrace the feeling of creeping cold that shrouds your senses and numbs you to the core. It isn't long before your fingertips feel frozen and your colour perception fades. But now you can see the unseen.",
			"Two shadowy figures stand in the distance, a few hundred paces from the settlement. If you want to find out who they are, you'll have to get closer. The problem is, you don't think you can get much closer without being noticed."
		],
		"options": {
			"You don't think this is going to work.": [
				"142"
			],
			"[Ring of sand] What if...": [
				"144"
			]
		},
		"time": 0.25
	},
	"142": {
		"text": [
			"Your grasp of the Shadow Realm fades, and your senses return to normal.",
			"Well. That was a waste of time."
		],
		"options": {
			"Head back to the rug merchant.": [
				"143"
			]
		}
	},
	"143": {
		"text": [
			"The magic carpets leaving the monkey colony only go to Pollnivneach and Al Kharid. Thankfully, they're free of charge."
		],
		"options": {
			"Travel to Pollnivneach.": [
				"185"
			],
			"Travel to Al Kharid.": [
				"180"
			]
		}
	},
	"144": {
		"text": [
			"This is, without a doubt, the dumbest idea you've had in recent memory. But your curiosity gets the better of you.",
			"You activate the ring and it transforms you into a pile of sand. As the desert breeze picks up, you drift closer and closer towards the two figures until you can make out the skull insignia on their chestplates.",
			"Khazard's men. You don't recall them being here in the original miniquest, or travelling in pairs for that matter, but then again it stands to reason that Khazard would have more than four spies worldwide."
		],
		"options": {
			"Continue.": [
				"145"
			]
		},
		"time": 0.25,
		"achievement": [
			"Shadow Knowledge",
			"Learned something you shouldn't have."
		]
	},
	"145": {
		"text": [
			"As much as you would like to come out of hiding and dispatch the scouts with a few blood spells, the quest log confirms that it isn't time to deal with them yet. You know better than to do anything that might affect the course of history, at least until you become World Guardian. There are simply too many risks involved."
		],
		"options": {
			"Instead, you drift slowly back towards the rug merchant.": [
				"143"
			]
		}
	},
	"160": {
		"text": [
			"You are in Nardah."
		],
		"options": {
			"Consider your surroundings.": [
				"161"
			],
			"Visit Ali the Wise.": [
				"162"
			],
			"Travel to another settlement.": [
				"5"
			]
		},
		"location": "Nardah"
	},
	"161": {
		"text": [
			"Nardah has always been the smaller, humbler cousin of Pollnivneach. You note with satisfaction the cascade of fresh water from the fountain in the town square, and the friendly nods from those residents who are old enough to remember your help. Still, there is not much to do here, and when you visit it is for one reason only."
		],
		"options": {
			"Continue.": [
				"160"
			]
		}
	},
	"162": {
		"text": [
			"It is clear from Ali the Wise's face as he answers the door that he is not expecting any visitors, but his guarded expression turns to one of delight as he sees you. \"Come in, Ashlyn!\" he says, smiling warmly as he holds the door open."
		],
		"options": {
			"You are ushered into a seat.": [
				"163"
			]
		},
		"location": "Ali the Wise's home",
		"time": 0.25
	},
	"163": {
		"text": [
			"By now the routine is a familiar one. Pax and Nike curl up in a corner while Ali moves about the small house, humming to himself as he gathers the supplies to make tea. When it is ready, he sets two cups on the table and sits down across from you.",
			"\"I don't think I can stay long,\" you apologize. \"I'm having a busy day, and I keep wasting time for no reason, and there's still so much I need to do before dinner --\"",
			"\"Ashlyn.\" His gentle, steadying voice calms you down. \"Take a deep breath with me.\"",
			"You do so, although it comes out shakier than you'd like. His own breathing is even and carefully measured.",
			"\"You have all the time in the world.\"",
			"[Time is paused until you leave Ali the Wise's home.]"
		],
		"options": {
			"Continue.": [
				"164"
			]
		}
	},
	"164": {
		"text": [
			"Ali the Wise turns his full attention to you, grey eyes bright."
		],
		"options": {
			"Consider your surroundings.": [
				"165"
			],
			"\"Any news about the Zamorakian Mahjarrat?\"": [
				"166"
			],
			"\"What about that Zarosian Mahjarrat, the one I helped with the temple?\"": [
				"167"
			],
			"\"I'd be grateful for another astronomy lesson.\"": [
				"168"
			],
			"\"Sometimes I feel like the weight of the whole world is on my shoulders.\"": [
				"169"
			],
			"\"I'd like another cup of tea, please.\"": [
				"171",
				"172",
				"173",
				"174",
				"175"
			],
			"I think it's time for me to go.": [
				"176"
			]
		}
	},
	"165": {
		"text": [
			"A light breeze filters through the window, infuses fresh life into the languor of the dry season. The air carries the faint scent of chocolate from the vendor in the square.",
			"As you survey the bookshelves, the scrolls, the chess table, the man who sits before you wearing his familiar knowing smile, you feel the uncommon joy of mutual understanding. It fills you with a strange giddiness, and you almost feel compelled to tell him --",
			"-- tell him how grateful you are to have a friend in this place, how terribly lonely you were before you met him, and isn't it wonderful how two lonely people can find each other? And in return you promise to defend him when he needs it, to fight for him because he deserves it --",
			"Then the moment passes, and you realize that of course you can't say anything. So you don't."
		],
		"options": {
			"Even so, you hope he knows.": [
				"164"
			]
		}
	},
	"166": {
		"text": [
			"He frowns. \"This and that. Nothing I can really substantiate. Lucien is as much of a threat as ever, of course. When the time comes, we'll need all the allies we can find if we want a chance at defeating him. The enemy of our enemy, and all that.\""
		],
		"options": {
			"\"Of course,\" you say. \"I understand completely. And I'll be there.\"": [
				"164"
			]
		}
	},
	"167": {
		"text": [
			"Ali takes some time to think about the question. \"I certainly didn't expect to meet him when I did. It was, let's say, a welcome surprise. He and the rest of his Zarosian kin seem comparatively benign towards humans and willing to fight against the Zamorakians, both of which are good news for us.\"",
			"He pauses, then continues.",
			"\"It seems to me that it can't be easy for someone like him from the Third Age to adjust to the realities of the Fifth. It's effectively like waking up in an entirely different world.\""
		],
		"options": {
			"The corner of your mouth twists wryly at that.": [
				"164"
			]
		}
	},
	"168": {
		"text": [
			"\"Why, Ashlyn,\" he beams, \"I thought you'd never ask.\"",
			"He spends a while poring over a selection of astronomical diagrams from one of his bookshelves, teaching you the names of notable celestial phenomena and delving into the mathematical principles that govern their movement. Though you find the lesson hard to follow at times, it's nice to see him in his element."
		],
		"options": {
			"And it's the most fun you've had in a while.": [
				"164"
			]
		}
	},
	"169": {
		"text": [
			"\"How so?\" he asks gently.",
			"You take another deep breath, trying to find an explanation for your feelings that would make sense to someone who doesn't know the future.",
			"\"The stakes I'm dealing with in my adventures are higher than ever. Every day, more and more people count on me to protect them. Sometimes it feels like… like failure will mean the end of the world.\""
		],
		"options": {
			"He nods, listening.": [
				"170"
			]
		}
	},
	"170": {
		"text": [
			"\"I can understand that,\" he says after a while. \"Maybe too well. And what I would say is that failure -- even unfathomable failure -- is a good teacher. Of humility, for example. And patience. Failure can lead to new opportunities, new connections, far down the road.\"",
			"While you don't doubt that this is good general advice, you're not sure the Great Revision could really lead to new opportunities. \"But what if I absolutely can't fail?\"",
			"\"Then instead of focusing on the outcome, let's refine the process.\" He smiles at you encouragingly. \"When the weight of responsibility feels crushing, breathe. Think methodically. Break the overwhelming problem into smaller problems, and solve those problems one at a time.\""
		],
		"options": {
			"You try to take his words to heart.": [
				"164"
			]
		}
	},
	"171": {
		"text": [
			"\"Of course\", he says as he pours you another cup."
		],
		"options": {
			"It's great tea.": [
				"164"
			]
		}
	},
	"172": {
		"text": [
			"He seems amused by your enthusiasm, but does not object. You savour the taste as you drink."
		],
		"options": {
			"You love black tea, and though you can usually get it from Menaphos now that the city has opened up, you find that it tastes better when he makes it.": [
				"164"
			]
		}
	},
	"173": {
		"text": [
			"\"Ashlyn, are you okay?\" His expression has changed from entertained to perplexed. You lap up the next cup greedily."
		],
		"options": {
			"It's just really, really good tea.": [
				"164"
			]
		}
	},
	"174": {
		"text": [
			"\"This is... more than a little concerning. You can have this last cup, but that's it.\" You take it from his hands and swallow it in a single gulp."
		],
		"options": {
			"Soooooo gooooood.": [
				"164"
			]
		}
	},
	"175": {
		"text": [
			"\"Did you hear me, Ashlyn?\" Ali's voice is stern. \"No more tea.\""
		],
		"options": {
			"You don't respond. You've entered a momentary tea coma.": [
				"164"
			]
		},
		"achievement": [
			"Tea Addict",
			"Drank a bewildering amount of tea."
		]
	},
	"176": {
		"text": [
			"He stands up to walk you out. As he does so, your eyes land on his desk in the corner of the room, and you notice something you hadn't before. The complex astronomical charts have one thing in common: the syzygy. The planetary alignment that marks the upcoming Mahjarrat ritual."
		],
		"options": {
			"He must be more worried about it than he lets on.": [
				"177"
			]
		}
	},
	"177": {
		"text": [
			"(As she is leaving, he hears the faintest whisper. It is almost inaudible, even to his sharpened senses, and afterwards when he is mulling it over he thinks he must have imagined it.)"
		],
		"options": {
			"\"You're gonna do great.\"": [
				"160"
			]
		},
		"goals": "Talk to Ali the Wise"
	},
	"180": {
		"text": [
			"The magic carpet heads towards Al Kharid."
		],
		"options": {
			"Continue": [
				"120"
			]
		},
		"time": 1
	},
	"181": {
		"text": [
			"The magic carpet drops you off at the Bedabin camp."
		],
		"options": {
			"Continue": [
				"40"
			]
		},
		"time": 1
	},
	"182": {
		"text": [
			"The magic carpet drops you off in Menaphos."
		],
		"options": {
			"Continue": [
				"60"
			]
		},
		"time": 1
	},
	"183": {
		"text": [
			"The magic carpet drops you off in the monkey colony."
		],
		"options": {
			"Continue": [
				"140"
			]
		},
		"time": 1
	},
	"184": {
		"text": [
			"The magic carpet drops you off in Nardah."
		],
		"options": {
			"Continue": [
				"160"
			]
		},
		"time": 1
	},
	"185": {
		"text": [
			"The magic carpet drops you off in Pollnivneach."
		],
		"options": {
			"Continue": [
				"20"
			]
		},
		"time": 1
	},
	"186": {
		"text": [
			"The magic carpet drops you off outside Sophanem."
		],
		"options": {
			"Continue": [
				"100"
			]
		},
		"time": 1
	},
	"187": {
		"text": [
			"The magic carpet drops you off in Uzer."
		],
		"options": {
			"Continue": [
				"80"
			]
		},
		"time": 1
	},
	"200": {
		"text": [
			"It's time.",
			"No matter what you managed or didn't manage to finish today, you can't miss your sister's birthday dinner. You interrupt what you were doing to break open your Rimmington teleport tablet…"
		],
		"options": {
			"...and the world changes around you.": [
				"201"
			]
		}
	},
	"201": {
		"text": [
			"Your parents gave you their spare key when you moved out, so you unlock the front door and enter the house without fanfare. You hear laughter and warm voices from the direction of the dining room. No one seems to have noticed you yet."
		],
		"options": {
			"[Tenti pineapple] You head to the kitchen.": [
				"202"
			],
			"You head to the kitchen.": [
				"203"
			]
		},
		"location": "Your parents' home"
	},
	"202": {
		"text": [
			"They've rearranged the kitchen since the last time you were here, but you manage to find a cake tin stowed away in the shelves, as well as flour, eggs, and milk in the larder. You get to work skinning, coring, and dicing the Tenti pineapple, incorporating the pieces into the cake as it's being prepared.",
			"While it's baking, your mother walks into the kitchen.",
			"\"Ashlyn!\" she shouts, wrapping you in a one-sided hug. \"Your dad and I haven't seen you in so long -- oh, but never mind that. We're just glad you remembered your sister's birthday.\"",
			"\"Come on, mom, that's not fair,\" you complain, trying to extricate yourself from her arms. \"I've never forgotten even once!\"",
			"She releases you and sniffs the air curiously. \"What is that smell?\"",
			"\"I'm baking a special cake for Iris. It's made with a rare kind of pineapple grown by the Bedabin people near the coast. They call it 'the ambrosia of the desert'.\"",
			"\"Well, that sounds wonderful, sweetie. You do that, and I'll get Katie to start making dinner.\""
		],
		"options": {
			"Later, at dinnertime...": [
				"204"
			]
		}
	},
	"203": {
		"text": [
			"They've rearranged the kitchen since the last time you were here, but you manage to find a cake tin stowed away in the shelves, as well as flour, eggs, and milk in the larder. You're almost ready to start… except you haven't managed to find a special ingredient, and you refuse to make the kind of normal, boring cake that Iris has probably had a hundred times by now. You'll have to improvise.",
			"Your mind suddenly lights up with -- inspiration? madness? let's call it inspiration -- as an idea comes to you. You begin frantically working on the cake.",
			"While it's baking, your mother walks into the kitchen.",
			"\"Ashlyn!\" she shouts, wrapping you in a one-sided hug. \"Your dad and I haven't seen you in so long -- oh, but never mind that. We're just glad you remembered your sister's birthday.\"",
			"\"Come on, mom, that's not fair,\" you complain, trying to extricate yourself from her arms. \"I've never forgotten even once!\"",
			"She releases you and sniffs the air curiously. \"What is that smell?\"",
			"\"I'm baking a… special cake for Iris. It's a surprise.\"",
			"She quirks an eyebrow. \"That certainly sounds interesting, sweetie. You do that, and I'll get Katie to start making dinner.\""
		],
		"options": {
			"Later, at dinnertime...": [
				"205"
			]
		}
	},
	"204": {
		"text": [
			"Your sister's tenth birthday dinner is a joyous occasion. Iris is clearly thrilled to have everyone's attention on her as she babbles on about school, her toys, her friends, and how she's going to be just like her adventurer sister when she grows up. You've got mixed feelings about that last part, but you keep them to yourself.",
			"When the cake comes out, Iris' eyes grow wide. \"Wow! What kind of cake is that?\"",
			"You smile. \"It's a special kind of cake I made just for your birthday. I know how much you love pineapple, and the pineapple I used here is better than most.\"",
			"You cut the first slice for her, and she happily digs in. \"Ashlyn, this is amazing!\" she manages to get out between bites.",
			"\"I know most shops were closed today because of the bank holiday,\" your father says. \"Was it hard to get the special pineapple?\""
		],
		"options": {
			"[Amulet of horsespeak] \"...Nah,\" you say. \"It wasn't too bad.\"": [
				"206"
			],
			"\"...Nah,\" you say. \"It wasn't too bad.\"": [
				"1000"
			]
		}
	},
	"205": {
		"text": [
			"Your sister's tenth birthday dinner is a joyous occasion. Iris is clearly thrilled to have everyone's attention on her as she babbles on about school, her toys, her friends, and how she's going to be just like her adventurer sister when she grows up. You've got mixed feelings about that last part, but you keep them to yourself.",
			"When the cake comes out, Iris' eyes grow wide. \"Wow! What kind of cake is that?\"",
			"You grin maniacally. \"It's a falafel cake. My latest and greatest culinary innovation.\"",
			"You cut the first slice for her. She hesitates for a second before bringing a forkful to her mouth.",
			"\"This is…\"",
			"You, your mother, your father, and the maid all lean forward in anticipation.",
			"\"...actually really, really delicious!\"",
			"Phew.",
			"Your father cuts a slice for himself, and seems shocked by how good it tastes. \"Ashlyn, can I know how you made this cake? I might sell the recipe to some of my friends at the Cooks' Guild. I think it's got real potential!\""
		],
		"options": {
			"[Amulet of horsespeak] In the coming months, your falafel cake becomes a sensation in bakeries across Gielinor. The proceeds from the recipes help your parents' business thrive.": [
				"206"
			],
			"In the coming months, your falafel cake becomes a sensation in bakeries across Gielinor. The proceeds from the recipes help your parents' business thrive.": [
				"1000"
			]
		},
		"achievement": [
			"Culinary Innovator",
			"Your new recipe took Gielinor's culinary scene by storm."
		]
	},
	"206": {
		"text": [
			"After dinner, you find Iris in her room.",
			"\"I've got another little present for you,\" you tell her. \"It's…\"",
			"It's an amulet of horsespeak, you almost say, but how could you possibly explain that to her? Besides, it's not like she'll ever be able to use it for its intended purpose.",
			"\"It's a toy,\" you settle on saying. \"It's a hornless unicorn toy with a string attached so you can wear it as a necklace.\"",
			"\"A hornless unicorn? That's so cool!\" she gushes, taking the amulet and beaming. \"When I'm an adventurer, I'm going to get as many presents for you as you've gotten for me all these years!\"",
			"You look at her and sigh. On one hand, Iris is a lively and precocious child who already finds school boring because it's so easy. Her talents would be wasted on a conventional career, and you can't begrudge her for wanting to see the wider world and help people in need. On the other hand, the reason you work so hard every day is so that your family can live a tranquil life without always having to worry about the next world-ending threat. Sometimes ignorance is bliss."
		],
		"options": {
			"\"Maybe so,\" you equivocate. \"You still have plenty of time to decide.\"": [
				"1000"
			]
		}
	},
	"207": {
		"text": [
			"While getting ready for bed that night, you can't help but worry about your progress. You're glad that you managed to make your sister happy, but you really should have trained more skills today. How are you going to stop the Great Revision if you can't even accomplish the goals you set for a single day? You settle in for a night of fitful and uncomfortable sleep."
		],
		"options": {
			"End the game.": [
				"210"
			]
		}
	},
	"208": {
		"text": [
			"While getting ready for bed that night, you can't help but stress about the big picture. It doesn't matter that you spent much of the day skilling, you're worried that it's never going to be enough to become the World Guardian, or defeat Sliske, or stop the Great Revision. You need to start waking up earlier, taking fewer breaks, sleeping fewer hours…",
			"Maybe talking to a friend would have helped you calm down. As it is, you settle in for a night of fitful and uncomfortable sleep."
		],
		"options": {
			"End the game.": [
				"210"
			]
		}
	},
	"209": {
		"text": [
			"While getting ready for bed that night, you watch Pax and Nike chase each other around the room as you spend some time contemplating life. You realize that although you know your sister’s birthday by heart, you can’t seem to remember your own. Your original date of birth, prior to that fateful day when you woke up in Taverley and everything changed. The before times.",
			"You had friends, or at least you think you did. You worked in an office building… or were you self-employed? There was a whole world you left behind. But more and more, Gielinor is starting to feel like the real world. The past drifts further and further away. Someday it will be nothing but a distant and nebulous dream.",
			"For better or worse, this is your life now. And tonight, as the cats curl up next to you in bed, life feels pretty alright. Tomorrow will bring new challenges, but as long as you keep a cool head and face those challenges one at a time, you’ll be ready for whatever the day has in store.",
			"You’ve got this, Ashlyn."
		],
		"options": {
			"End the game.": [
				"210"
			]
		}
	},
	"210": {
		"text": [
			"Thank you so much for playing!",
			"On subsequent playthroughs, you can type \"end\" into the text box to progress directly to the epilogue.",
			"Below are the achievements you've unlocked during this playthrough. There are five achievements in total, and they can't all be obtained on the same run."
		],
		"options": {},
		"location": ""
	}
}